# Personal homebrew package list
# Install using `brew bundle --global`
#
# To view what things are installed in homebrew

## Taps
tap 'homebrew/services'
tap 'versent/taps' # saml2aws
tap 'aws/tap' # aws tools
tap 'goodwithtech/r' # dockle
tap 'hashicorp/tap' # terraform, vagrant etc
tap 'jmespath/jmespath' #JSON query language
tap 'wez/wezterm'

# For X stuff
cask 'xquartz'

## Normal homebrew stuff
# Essentials
brew 'awscli'
brew 'fd' # Fast implementation of Find
brew 'git' 
brew 'jq' # JSON Processor
brew 'mtr' # Network Diagnostics
brew 'nvim' 
brew 'ripgrep' # find -exec grep but _good_
brew 'sd' # better sed
brew 'sqlite' 
brew 'stow' 

# Shell helpers
brew 'bash'
brew 'bash-completion@2' # @2 is the newer version that requires newer bash
brew 'direnv'
brew 'autojump'
brew 'fzf'

# Nice to haves
brew 'a2ps' # anything to postscript
brew 'ansible' 
brew 'awslogs' # CloudWatch logs for humans
brew 'azure-cli'
brew 'cfssl' # Cloudflare SSL
brew 'cli53' # Route 53 CLI Tool
brew 'colordiff' # Diff but pretty. I never use this, not sure why I keep it
brew 'cookiecutter' # Create projects from templates
brew 'feh' # Fast Image Viewer
brew 'ghostscript'
brew 'go-jira' # Jira Cli client. Written in Go so it says Go in it
brew 'gomplate' # Template rendering, see above for the Go bit
brew 'graphicsmagick' # Image processing
brew 'graphviz' # Graph visualization
brew 'hub'
brew 'kops' # K8s Operations
brew 'kubernetes-cli'
brew 'ledger' # Accounting system
brew 'libxv'
brew 'magic-wormhole' # Drop from one comp to another
cask 'mitmproxy'
brew 'mosh' # Mobile shell
brew 'mpc'
brew 'mpv' # Cli video player
brew 'minikube'
brew 'nginx'
brew 'ngrep' # PCAP grep
brew 'nmap'
brew 'openvpn'
brew 'pgbadger' # Postgresql Log Analyzer
brew 'pgcli'
brew 'postgresql'
brew 'pygments'
brew 'qrencode'
brew 'redis'
brew 'saml2aws'
brew 'shellcheck'
brew 'sipcalc'
brew 'socat'
brew 'sox'
brew 'ssh-copy-id'
brew 'switchaudio-osx'
brew 'sysdig'
brew 'tealdeer'
brew 'telnet'
brew 'tarsnap'
brew 'thefuck'
brew 'tmux'
brew 'watch'
brew 'wdiff'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'xz'

# Programming languages
brew 'elixir'
brew 'node'
brew 'python3'
brew 'rust'
brew 'lua'
brew 'luarocks'
brew 'cmake'
brew 'npm'
brew 'gimme'
# Application wrappers
brew 'pipx'

# jmespath.org - jq alternative
tap 'jmespath/jmespath'
brew 'jmespath/jmespath/jp'

# Hashicorp
brew 'consul'
cask 'vagrant'
brew 'tfenv'

## Fonts
cask 'font-hack-nerd-font'

## Mac apps (casks)
cask '1password'
cask 'alfred'
cask 'audio-hijack'
cask 'bartender'
cask 'bibdesk'
cask 'dash'
cask 'djview'
cask 'dropbox'
cask 'dungeon-crawl-stone-soup-tiles'
cask 'gas-mask'
cask 'gimp'
cask 'hammerspoon'
cask 'iterm2'
cask 'openscad'
cask 'skype'
cask 'telegram'
cask 'ubersicht'
cask 'viscosity'
cask 'vlc'
cask 'wezterm'
cask 'wireshark'
