# Personal homebrew package list
# Install using `brew bundle --global`
#
# To view what things are installed in homebrew

## Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'versent/taps' # saml2aws
tap 'aquasecurity/trivy'
tap 'aws/tap' # aws tools
tap 'goodwithtech/r' # dockle
tap 'hashicorp/tap' # terraform, vagrant etc
tap 'jmespath/jmespath' #JSON query language
tap 'wez/wezterm'

# For X stuff
cask 'xquartz'

## Normal homebrew stuff
# Essentials
brew 'awscli'
brew 'fd'
brew 'git'
brew 'jq'
brew 'mtr'
brew 'nvim'
brew 'ripgrep'
brew 'sd'
brew 'sqlite'
brew 'stow'

# Shell helpers
brew 'bash'
brew 'bash-completion@2' # @2 is the newer version that requires newer bash
brew 'direnv'
brew 'autojump'
brew 'fzf'

# Nice to haves
brew 'a2ps'
brew 'ansible'
brew 'awslogs'
brew 'azure-cli'
brew 'cfssl'
brew 'cli53'
brew 'colordiff'
brew 'cookiecutter'
brew 'feh'
brew 'go-jira'
brew 'gomplate'
brew 'graphicsmagick'
brew 'graphviz'
brew 'hub'
brew 'kops'
brew 'kubernetes-cli'
brew 'ledger'
brew 'magic-wormhole'
brew 'mitmproxy'
brew 'mosh'
brew 'mpc'
brew 'mpv'
brew 'minikube'
brew 'nginx'
brew 'ngrep'
brew 'nmap'
brew 'openvpn'
brew 'pgbadger'
brew 'pgcli'
brew 'postgresql'
brew 'pssh'
brew 'pwgen'
brew 'qrencode'
brew 'redis'
brew 'saml2aws'
brew 'shellcheck'
brew 'sipcalc'
brew 'socat'
brew 'sox'
brew 'ssh-copy-id'
brew 'switchaudio-osx'
brew 'sysdig'
brew 'telnet'
brew 'tarsnap'
brew 'tmux'
brew 'watch'
brew 'wdiff'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'xz'

# Programming languages
brew 'node'
brew 'python3'
brew 'rust'

# Application wrappers
brew 'pipx'

# jmespath.org - jq alternative
tap 'jmespath/jmespath'
brew 'jmespath/jmespath/jp'

# Hashicorp
brew 'consul'
brew 'packer'
cask 'vagrant'
brew 'vault'
brew 'tfenv'

## Fonts
cask 'font-hack-nerd-font'

## Mac apps (casks)
cask '1password'
cask 'alfred'
cask 'arduino'
cask 'audio-hijack'
cask 'bartender'
cask 'bibdesk'
cask 'dash'
cask 'dropbox'
cask 'dungeon-crawl-stone-soup-tiles'
cask 'gas-mask'
cask 'gimp'
cask 'hammerspoon'
cask 'iterm2'
cask 'openscad'
cask 'skype'
cask 'telegram'
cask 'ubersicht'
cask 'viscosity'
cask 'vlc'
cask 'vmware-fusion'
cask 'wezterm'
cask 'wireshark'
